run/parasiticCurrents/stationaryDroplet3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (0.006 0 0)
    (0.006 0.006 0)
    (0 0.006 0)
    (0 0 0.006)
    (0.006 0 0.006)
    (0.006 0.006 0.006)
    (0 0.006 0.006)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3) (2 6 5 1) (3 7 6 2) (1 5 4 0) (0 3 2 1) (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
